"""
问题: 输出九九乘法表，格式如下：
1 * 1 = 1       1 * 2 = 2       1 * 3 = 3       1 * 4 = 4       1 * 5 = 5
1 * 6 = 6       1 * 7 = 7       1 * 8 = 8       1 * 9 = 9       2 * 2 = 4
2 * 3 = 6       2 * 4 = 8       2 * 5 = 10      2 * 6 = 12      2 * 7 = 14
2 * 8 = 16      2 * 9 = 18      3 * 3 = 9       3 * 4 = 12      3 * 5 = 15
3 * 6 = 18      3 * 7 = 21      3 * 8 = 24      3 * 9 = 27      4 * 4 = 16
4 * 5 = 20      4 * 6 = 24      4 * 7 = 28      4 * 8 = 32      4 * 9 = 36
5 * 5 = 25      5 * 6 = 30      5 * 7 = 35      5 * 8 = 40      5 * 9 = 45
6 * 6 = 36      6 * 7 = 42      6 * 8 = 48      6 * 9 = 54      7 * 7 = 49
7 * 8 = 56      7 * 9 = 63      8 * 8 = 64      8 * 9 = 72      9 * 9 = 81

每行输出5个乘法表达式，中间通过制表符隔开，每输出5个表达式换行。
"""


"""
操作提示：
print() - 函数可以输出一个空行。
print有一个参数叫做end，可以指定输出的结尾，默认是换行符\n。
print("mytext", end="\t") - 表示输出后不换行，而是输出一个制表符\t()。
print(f"{myvar}") - 可以输出变量myvar的值。
"""

"""
解题思路:
1. 使用两个for循环，外层循环i从1到9，内层循环j从i到9。
2. 输出乘法表达式i * j = i * j，中间通过制表符隔开。
3. 使用lineCounter变量记录输出的表达式个数，每输出5个表达式换行。
"""

"""
侧重点:
1. for循环的使用。
2. 输出格式的控制。
3. 条件判断的使用。
4. %运算符的使用。
5. counter变量的使用。
"""

