"""
什么是Python中的整数类型?
___________________________
"""

"""
浮点数和整数相加的结果是什么类型? ______
"""

"""
如何在Python中创建一个字符串变量? 请举例说明。
_____________________________________________________
"""

"""
[多选] 以下哪个变量名是不合法的？
A. player1Health
B. player_health
C. 1playerHealth
D. PlayerHealth
E. player-health
"""

"""
什么是常量, 如何命名常量?
"""

"""
___ = ____
"""

"""
小驼峰命名法的特点是什么？
"""

"""
x = 15
y = 2.0
x + y 的结果是什么?
______
"""


"""
在Python中，字符串和变量的区别是什么？
"""

"""
以下关于变量命名规则的说法，哪一项是正确的？

a) 变量名可以包含空格
b) 变量名不能以数字开头
c) 变量名可以包含特殊符号如@或#
d) 变量名不区分大小写
"""
